app/controllers/api/v1/admins_controller.rb

    def index
        admins = Admin.all
---
SELECT "admins".* FROM "admins"