app/controllers/api/v1/appointments_controller.rb

    def index
        appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"