app/controllers/api/v1/bigs_controller.rb

SELECT "bigs".* FROM "bigs"
---
    def index
        bigs = Big.all

INSERT INTO "bigs" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        big = Big.new(
            username: params[:username],
            password: params[:password]
        )
        if big.save