app/controllers/api/v1/littles_controller.rb

    def index
        littles = Little.all
---
SELECT "littles".* FROM "littles"